from transliterate import translit

chars_list = ["Дехья", "Мика", "Аль-Хайтам", "Яо Яо", "Странник", "Фарузан", "Лайла", "Нахида", "Нилу", "Сайно", "Кандакия", "Дори", "Тигнари", "Коллеи", "Хэйдзо", "Куки Синобу", "Е Лань", "Камисато Аято", "Яэ Мико", "Шэнь Хэ", "Юнь Цзинь", "Аратаки Итто", "Горо", "Тома", "Кокоми", "Райдэн", "Элой", "Кудзё Сара", "Ёимия", "Саю", "Камисато Аяка", "Каэдэхара Кадзуха", "Эола", "Янь Фэй", "Розария", "Ху Тао", "Сяо", "Гань Юй", "Альбедо", "Чжун Ли", "Синь Янь", "Тарталья", "Диона", "Кли", "Венти", "Ци Ци", "Мона", "Кэ Цин", "Дилюк", "Джинн", "Эмбер", "Чун Юнь", "Фишль", "Сян Лин", "Син Цю", "Сахароза", "Рэйзор", "Ноэлль", "Нин Гуан", "Лиза", "Кэйа", "Бэй Доу", "Беннет", "Барбара", "Путешественник"]

def image_maker(chars_list):
    chars_dict_list = []
    for i in chars_list:
        url = translit(i, language_code='ru', reversed=True)
        url = url.replace("'", "")
        url = url.replace("-", "")
        url = url.replace(" ", "")
        url = url.lower()
        chars_dict={'url': url, 'name': i}
        chars_dict_list.append(chars_dict)
    return chars_dict_list

a = image_maker(chars_list)
for i in a:
    #print(i)
    print(i['url'])